Tekla Open API Reference for Tekla Structures 2025
BooleanPart Constructor
 Instantiates an empty cut operation.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BooleanPart()
Public Sub New
See Also
Reference
BooleanPart Class
Tekla.Structures.Model Namespace